---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPerforations
source: html/0b60323b-6cd8-4fc3-a9c1-40c28ece965b.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPerforations Property

The property labeled "Cutouts" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPerforations { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPerforationsType".